package work5;

/**
 * Інтерфейс для управління базою даних.
 * <p>
 * Цей інтерфейс визначає методи для виконання операцій над записами в базі даних,
 * таких як додавання, оновлення та видалення записів.
 * </p>
 */
public interface DatabaseManager {
    /**
     * Додає новий запис до бази даних.
     *
     * @param record запис, який потрібно додати
     */
    void addRecord(DatabaseRecord record);

    /**
     * Оновлює існуючий запис у базі даних.
     *
     * @param id    ідентифікатор запису, який потрібно оновити
     * @param record новий запис, який замінить старий
     */
    void updateRecord(int id, DatabaseRecord record);

    /**
     * Видаляє запис з бази даних.
     *
     * @param id ідентифікатор запису, який потрібно видалити
     */
    void deleteRecord(int id);
}